---

C#Visual BasicVisual C++

Revit 2024 API
---
WorksetId Constructor
WorksetId Class See Also Send Feedback
---

Create an WorksetId handle with the given integer id.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public WorksetId(
    	int id
    )

Visual Basic
---

    Public Sub New ( _
    	id As Integer _
    )

Visual C++
---

    public:
    WorksetId(
    	int id
    )

#### Parameters

id
    Type: System..::..Int32The id.

# See Also

WorksetId Class

Autodesk.Revit.DB Namespace